#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```
terraform
module.repository_rust_svc["scheduler"].data.github_team.owner: Reading...
module.repository_lib_template["rust"].github_repository.repository: Refreshing state... [id=lib-template-rust]
module.repository_svc_template["python"].data.github_team.owner: Reading...
module.repository_svc_template["typescript"].data.github_team.owner: Reading...
module.repository["clabot-config"].data.github_team.owner: Reading...
module.repository["benchmarks"].data.github_team.owner: Reading...
module.repository["se-services"].data.github_team.owner: Reading...
module.repository["tools"].data.github_team.owner: Reading...
module.repository_rust_svc["storage"].data.github_team.owner: Reading...
module.repository_tf["onboarding"].github_repository.repository: Refreshing state... [id=tf-onboarding]
module.repository["cla-bot"].data.github_team.owner: Reading...
module.repository_svc_template["rust"].data.github_team.owner: Reading...
module.repository_svc_template["python"].data.github_team.owner: Read complete after 4s [id=6311795]
module.repository_tf["onboarding"].data.github_team.owner: Reading...
module.repository_rust_svc["scheduler"].data.github_team.owner: Read complete after 7s [id=6311795]
module.repository_tf["github"].github_repository.repository: Refreshing state... [id=tf-github]
module.repository_svc_template["typescript"].data.github_team.owner: Read complete after 8s [id=6311795]
module.repository["website"].data.github_team.owner: Reading...
module.repository["clabot-config"].data.github_team.owner: Read complete after 8s [id=6029505]
module.repository_tf["github"].data.github_team.owner: Reading...
module.repository["benchmarks"].data.github_team.owner: Read complete after 9s [id=6311795]
module.repository_lib_template["rust"].data.github_team.owner: Reading...
module.repository["se-services"].data.github_team.owner: Read complete after 9s [id=6311795]
module.repository_svc_template["typescript"].github_repository.repository: Refreshing state... [id=svc-template-typescript]
module.repository["tools"].data.github_team.owner: Read complete after 10s [id=6203057]
module.repository["benchmarks"].github_repository.repository: Refreshing state... [id=benchmarks]
module.repository_rust_svc["storage"].data.github_team.owner: Still reading... [10s elapsed]
module.repository_rust_svc["storage"].data.github_team.owner: Read complete after 10s [id=6311795]
module.repository_svc_template["rust"].github_repository.repository: Refreshing state... [id=svc-template-rust]
module.repository["cla-bot"].data.github_team.owner: Still reading... [10s elapsed]
module.repository["cla-bot"].github_repository.repository: Refreshing state... [id=cla-bot]
module.repository_svc_template["rust"].data.github_team.owner: Still reading... [10s elapsed]
module.repository["cla-bot"].data.github_team.owner: Read complete after 11s [id=6029505]
module.repository_svc_template["python"].github_repository.repository: Refreshing state... [id=svc-template-python]
module.repository_svc_template["rust"].data.github_team.owner: Read complete after 10s [id=6311795]
module.repository["clabot-config"].github_repository.repository: Refreshing state... [id=clabot-config]
module.repository["tools"].github_repository.repository: Refreshing state... [id=tools]
module.repository["website"].github_repository.repository: Refreshing state... [id=website]
module.repository_rust_lib["router"].data.github_team.owner: Reading...
module.repository_lib_template["rust"].github_repository_webhook.map["discord"]: Refreshing state... [id=373104862]
module.repository_lib_template["rust"].github_branch.branch["develop"]: Refreshing state... [id=lib-template-rust:develop]
module.repository_tf["onboarding"].data.github_team.owner: Still reading... [10s elapsed]
module.repository_tf["onboarding"].data.github_team.owner: Read complete after 10s [id=6029505]
module.repository_tf["onboarding"].github_repository_webhook.map["discord"]: Refreshing state... [id=372087608]
module.repository_tf["github"].github_repository_webhook.map["discord"]: Refreshing state... [id=372087606]
module.repository_svc_template["typescript"].github_repository_webhook.map["discord"]: Refreshing state... [id=373104835]
module.repository_svc_template["typescript"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:svc-template-typescript]
module.repository_svc_template["python"].github_repository_webhook.map["discord"]: Refreshing state... [id=373104833]
module.repository_svc_template["rust"].github_repository_webhook.map["discord"]: Refreshing state... [id=373104840]
module.repository["website"].data.github_team.owner: Read complete after 9s [id=5490296]
module.repository_svc_template["python"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:svc-template-python]
module.repository_tf["github"].data.github_team.owner: Read complete after 9s [id=6029505]
module.repository_svc_template["rust"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:svc-template-rust]
module.repository_lib_template["rust"].data.github_team.owner: Read complete after 9s [id=6311795]
module.repository_svc_template["rust"].github_branch.branch["develop"]: Refreshing state... [id=svc-template-rust:develop]
module.repository_svc_template["typescript"].github_branch.branch["develop"]: Refreshing state... [id=svc-template-typescript:develop]
module.repository_svc_template["python"].github_branch.branch["develop"]: Refreshing state... [id=svc-template-python:develop]
module.repository_tf["onboarding"].github_branch_default.default: Refreshing state... [id=tf-onboarding]
module.repository_tf["github"].github_branch_default.default: Refreshing state... [id=tf-github]
module.repository_rust_lib["router"].github_repository.repository: Refreshing state... [id=lib-router]
module.repository_lib_template["rust"].github_branch_default.default: Refreshing state... [id=lib-template-rust]
module.repository_rust_svc["storage"].github_repository.repository: Refreshing state... [id=svc-storage]
module.repository_rust_svc["scheduler"].github_repository.repository: Refreshing state... [id=svc-scheduler]
module.repository_tf["onboarding"].github_team_repository.maintainer["devops"]: Refreshing state... [id=6029505:tf-onboarding]
module.repository_tf["onboarding"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:tf-onboarding]
module.repository_tf["github"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:tf-github]
module.repository_tf["github"].github_team_repository.maintainer["devops"]: Refreshing state... [id=6029505:tf-github]
module.repository_rust_lib["router"].data.github_team.owner: Read complete after 9s [id=6311795]
module.repository_lib_template["rust"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:lib-template-rust]
module.repository["website"].github_branch.branch["staging"]: Refreshing state... [id=website:staging]
module.repository["tools"].github_team_repository.maintainer["drone-engineering"]: Refreshing state... [id=6203057:tools]
module.repository["website"].github_team_repository.maintainer["webdevelopers"]: Refreshing state... [id=5490296:website]
module.repository["benchmarks"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:benchmarks]
module.repository["cla-bot"].github_team_repository.maintainer["devops"]: Refreshing state... [id=6029505:cla-bot]
module.repository["clabot-config"].github_team_repository.maintainer["devops"]: Refreshing state... [id=6029505:clabot-config]
module.repository_svc_template["python"].github_branch_default.default: Refreshing state... [id=svc-template-python]
module.repository_svc_template["rust"].github_branch_default.default: Refreshing state... [id=svc-template-rust]
module.repository_svc_template["typescript"].github_branch_default.default: Refreshing state... [id=svc-template-typescript]
module.repository_tf["onboarding"].github_repository_file.CODEOWNERS: Refreshing state... [id=tf-onboarding/.github/CODEOWNERS]
module.repository_tf["github"].github_repository_file.CODEOWNERS: Refreshing state... [id=tf-github/.github/CODEOWNERS]
module.repository_lib_template["rust"].github_repository_file.CODEOWNERS: Refreshing state... [id=lib-template-rust/.github/CODEOWNERS]
module.repository_rust_svc["storage"].github_repository_webhook.map["discord"]: Refreshing state... [id=372953439]
module.repository_rust_svc["storage"].github_branch.branch["develop"]: Refreshing state... [id=svc-storage:develop]
module.repository_rust_svc["scheduler"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:svc-scheduler]
module.repository_rust_svc["scheduler"].github_repository_webhook.map["discord"]: Refreshing state... [id=372953430]
module.repository_rust_svc["scheduler"].github_branch.branch["develop"]: Refreshing state... [id=svc-scheduler:develop]
module.repository_rust_svc["storage"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:svc-storage]
module.repository["clabot-config"].github_branch_default.default: Refreshing state... [id=clabot-config]
module.repository["tools"].github_branch_default.default: Refreshing state... [id=tools]
module.repository["website"].github_branch_default.default: Refreshing state... [id=website]
module.repository["benchmarks"].github_branch_default.default: Refreshing state... [id=benchmarks]
module.repository["cla-bot"].github_branch_default.default: Refreshing state... [id=cla-bot]
module.repository_svc_template["typescript"].github_repository_file.CODEOWNERS: Refreshing state... [id=svc-template-typescript/.github/CODEOWNERS]
module.repository_svc_template["python"].github_repository_file.CODEOWNERS: Refreshing state... [id=svc-template-python/.github/CODEOWNERS]
module.repository_svc_template["rust"].github_repository_file.CODEOWNERS: Refreshing state... [id=svc-template-rust/.github/CODEOWNERS]
module.repository_rust_lib["router"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:lib-router]
module.repository_rust_lib["router"].github_repository_webhook.map["discord"]: Refreshing state... [id=372953444]
module.repository_rust_lib["router"].github_branch.branch["develop"]: Refreshing state... [id=lib-router:develop]
module.repository_rust_svc["scheduler"].github_branch_default.default: Refreshing state... [id=svc-scheduler]
module.repository_rust_svc["storage"].github_branch_default.default: Refreshing state... [id=svc-storage]
module.repository["tools"].github_repository_file.CODEOWNERS: Refreshing state... [id=tools/.github/CODEOWNERS]
module.repository["website"].github_repository_file.CODEOWNERS: Refreshing state... [id=website/.github/CODEOWNERS]
module.repository["benchmarks"].github_repository_file.CODEOWNERS: Refreshing state... [id=benchmarks/.github/CODEOWNERS]
module.repository["cla-bot"].github_repository_file.CODEOWNERS: Refreshing state... [id=cla-bot/.github/CODEOWNERS]
module.repository["clabot-config"].github_repository_file.CODEOWNERS: Refreshing state... [id=clabot-config/.github/CODEOWNERS]
module.repository_tf["github"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOG6VIns4BpLGe]
module.repository_tf["github"].github_branch_protection.all["tf-github"]: Refreshing state... [id=BPR_kwDOG6VIns4BpnEQ]
module.repository_lib_template["rust"].github_branch_protection.all["lib-template-rust"]: Refreshing state... [id=BPR_kwDOHwJLh84BqmYC]
module.repository_lib_template["rust"].github_branch_protection.protection["develop"]: Refreshing state... [id=BPR_kwDOHwJLh84BqmYF]
module.repository_lib_template["rust"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHwJLh84BqmYD]
module.repository_rust_lib["router"].github_branch_default.default: Refreshing state... [id=lib-router]
module.repository_rust_svc["scheduler"].github_repository_file.files[".gitignore"]: Refreshing state... [id=svc-scheduler/.gitignore]
module.repository_rust_svc["scheduler"].github_repository_file.CODEOWNERS: Refreshing state... [id=svc-scheduler/.github/CODEOWNERS]
module.repository_rust_svc["scheduler"].github_repository_file.files[".editorconfig"]: Refreshing state... [id=svc-scheduler/.editorconfig]
module.repository_rust_svc["scheduler"].github_repository_file.files[".github/workflows/python_ci.yml"]: Refreshing state... [id=svc-scheduler/.github/workflows/python_ci.yml]
module.repository_rust_svc["scheduler"].github_repository_file.files[".github/workflows/rust_ci.yml"]: Refreshing state... [id=svc-scheduler/.github/workflows/rust_ci.yml]
module.repository_rust_svc["scheduler"].github_repository_file.files[".cargo-husky/hooks/README.md"]: Refreshing state... [id=svc-scheduler/.cargo-husky/hooks/README.md]
module.repository_rust_svc["scheduler"].github_repository_file.files[".cargo-husky/hooks/pre-push"]: Refreshing state... [id=svc-scheduler/.cargo-husky/hooks/pre-push]
module.repository_rust_svc["scheduler"].github_repository_file.files[".cargo/config.toml"]: Refreshing state... [id=svc-scheduler/.cargo/config.toml]
module.repository_rust_svc["scheduler"].github_repository_file.files[".github/workflows/editorconfig_check.yml"]: Refreshing state... [id=svc-scheduler/.github/workflows/editorconfig_check.yml]
module.repository_rust_svc["scheduler"].github_repository_file.files[".cargo-husky/hooks/pre-commit"]: Refreshing state... [id=svc-scheduler/.cargo-husky/hooks/pre-commit]
module.repository_rust_svc["storage"].github_repository_file.files[".cargo/config.toml"]: Refreshing state... [id=svc-storage/.cargo/config.toml]
module.repository_rust_svc["storage"].github_repository_file.CODEOWNERS: Refreshing state... [id=svc-storage/.github/CODEOWNERS]
module.repository_rust_svc["storage"].github_repository_file.files[".github/workflows/rust_ci.yml"]: Refreshing state... [id=svc-storage/.github/workflows/rust_ci.yml]
module.repository_rust_svc["storage"].github_repository_file.files[".github/workflows/editorconfig_check.yml"]: Refreshing state... [id=svc-storage/.github/workflows/editorconfig_check.yml]
module.repository_rust_svc["storage"].github_repository_file.files[".gitignore"]: Refreshing state... [id=svc-storage/.gitignore]
module.repository_rust_svc["storage"].github_repository_file.files[".cargo-husky/hooks/README.md"]: Refreshing state... [id=svc-storage/.cargo-husky/hooks/README.md]
module.repository_rust_svc["storage"].github_repository_file.files[".cargo-husky/hooks/pre-push"]: Refreshing state... [id=svc-storage/.cargo-husky/hooks/pre-push]
module.repository_rust_svc["storage"].github_repository_file.files[".github/workflows/python_ci.yml"]: Refreshing state... [id=svc-storage/.github/workflows/python_ci.yml]
module.repository_rust_svc["storage"].github_repository_file.files[".cargo-husky/hooks/pre-commit"]: Refreshing state... [id=svc-storage/.cargo-husky/hooks/pre-commit]
module.repository_rust_svc["storage"].github_repository_file.files[".editorconfig"]: Refreshing state... [id=svc-storage/.editorconfig]
module.repository_svc_template["typescript"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHtu-d84BqmXx]
module.repository_svc_template["typescript"].github_branch_protection.protection["develop"]: Refreshing state... [id=BPR_kwDOHtu-d84BqmXu]
module.repository_svc_template["rust"].github_branch_protection.all["svc-template-rust"]: Refreshing state... [id=BPR_kwDOHn-JXc4BqmXy]
module.repository_svc_template["python"].github_branch_protection.protection["develop"]: Refreshing state... [id=BPR_kwDOHrbxrc4BqmXs]
module.repository_svc_template["python"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHrbxrc4BqmXr]
module.repository_svc_template["rust"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHn-JXc4Bqprl]
module.repository_svc_template["typescript"].github_branch_protection.all["svc-template-typescript"]: Refreshing state... [id=BPR_kwDOHtu-d84BqmXw]
module.repository_svc_template["rust"].github_branch_protection.protection["develop"]: Refreshing state... [id=BPR_kwDOHn-JXc4BqmXz]
module.repository_svc_template["python"].github_branch_protection.all["svc-template-python"]: Refreshing state... [id=BPR_kwDOHrbxrc4BqmXq]
module.repository_rust_lib["router"].github_repository_file.CODEOWNERS: Refreshing state... [id=lib-router/.github/CODEOWNERS]
module.repository_rust_lib["router"].github_repository_file.files[".github/workflows/python_ci.yml"]: Refreshing state... [id=lib-router/.github/workflows/python_ci.yml]
module.repository_rust_lib["router"].github_repository_file.files[".github/workflows/editorconfig_check.yml"]: Refreshing state... [id=lib-router/.github/workflows/editorconfig_check.yml]
module.repository_rust_lib["router"].github_repository_file.files[".cargo-husky/hooks/README.md"]: Refreshing state... [id=lib-router/.cargo-husky/hooks/README.md]
module.repository_rust_lib["router"].github_repository_file.files[".cargo/config.toml"]: Refreshing state... [id=lib-router/.cargo/config.toml]
module.repository_rust_lib["router"].github_repository_file.files[".github/workflows/rust_ci.yml"]: Refreshing state... [id=lib-router/.github/workflows/rust_ci.yml]
module.repository_rust_lib["router"].github_repository_file.files[".cargo-husky/hooks/pre-push"]: Refreshing state... [id=lib-router/.cargo-husky/hooks/pre-push]
module.repository_rust_lib["router"].github_repository_file.files[".editorconfig"]: Refreshing state... [id=lib-router/.editorconfig]
module.repository_rust_lib["router"].github_repository_file.files[".cargo-husky/hooks/pre-commit"]: Refreshing state... [id=lib-router/.cargo-husky/hooks/pre-commit]
module.repository_rust_lib["router"].github_repository_file.files[".gitignore"]: Refreshing state... [id=lib-router/.gitignore]
module.repository["cla-bot"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHTAbhc4BmmRb]
module.repository["tools"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHn-Jf84BmmRe]
module.repository["website"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOGdyvzM4BiRcN]
module.repository["website"].github_branch_protection.protection["staging"]: Refreshing state... [id=BPR_kwDOGdyvzM4BiRcL]
module.repository["benchmarks"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHzRWt84Bqv9O]
module.repository["tools"].github_branch_protection.all["tools"]: Refreshing state... [id=BPR_kwDOHn-Jf84BpnEA]
module.repository["website"].github_branch_protection.all["website"]: Refreshing state... [id=BPR_kwDOGdyvzM4BpnEJ]
module.repository["benchmarks"].github_branch_protection.all["benchmarks"]: Refreshing state... [id=BPR_kwDOHzRWt84Bqv9P]
module.repository["cla-bot"].github_branch_protection.all["cla-bot"]: Refreshing state... [id=BPR_kwDOHTAbhc4BpnEE]
module.repository_rust_svc["storage"].github_branch_protection.protection["develop"]: Refreshing state... [id=BPR_kwDOHyi9jc4BqieG]
module.repository_rust_svc["storage"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHyi9jc4BqieF]
module.repository_rust_svc["storage"].github_branch_protection.all["svc-storage"]: Refreshing state... [id=BPR_kwDOHyi9jc4BqieI]
module.repository_rust_svc["scheduler"].github_branch_protection.protection["develop"]: Refreshing state... [id=BPR_kwDOHyi9hc4Bqidr]
module.repository_rust_svc["scheduler"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHyi9hc4Bqidt]
module.repository_rust_svc["scheduler"].github_branch_protection.all["svc-scheduler"]: Refreshing state... [id=BPR_kwDOHyi9hc4Bqidq]
module.repository_rust_lib["router"].github_branch_protection.protection["develop"]: Refreshing state... [id=BPR_kwDOHyi9o84Bqidv]
module.repository_rust_lib["router"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHyi9o84Bqid1]
module.repository_rust_lib["router"].github_branch_protection.all["lib-router"]: Refreshing state... [id=BPR_kwDOHyi9o84BqieE]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repository["benchmarks"].github_repository.repository has changed
  ~ resource "github_repository" "repository" {
      ~ branches               = [
          ~ {
              ~ name      = "main" -> "GoodluckH-patch-1"
              ~ protected = false -> true
            },
          + {
              + name      = "am-smith/dw-336/stack-poem-openapi-poe"
              + protected = false
            },
          + {
              + name      = "main"
              + protected = true
            },
        ]
      ~ etag                   = "W/\"8e000687176d661020f42a398bc35389e837b1feca85225045809854a993b982\"" -> "W/\"6dc7af7d815d3dedad0904a77ebc3dc9a25acbe71dcdea4da4df333d8c7ff7a1\""
        id                     = "benchmarks"
        name                   = "benchmarks"
      + topics                 = []
        # (25 unchanged attributes hidden)
    }

  # module.repository["website"].github_branch.branch["staging"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"42cf6f348d048759fd70f344a8607d184d9dd1041130999955a00b15fac03336\"" -> "W/\"527d983cc448865e470026f03dd66e78e554e8ef265833fc3993896bdc98bbbf\""
        id            = "website:staging"
      ~ sha           = "ef829fc2d836ab69ddc4c61712d90bd477d770b4" -> "16577b7be6c593f6fc81874bbdb88f1b1e3267ed"
        # (4 unchanged attributes hidden)
    }

  # module.repository_lib_template["rust"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"f49edce5be4a739537f37e02757fc81a29af1efa0913374a16f279bcbbb6f4e6\"" -> "W/\"ebc5f45a7343efdd08b41ad0a1fd46358ed8bde534935032a6d887dce95da3de\""
        id            = "lib-template-rust:develop"
        # (6 unchanged attributes hidden)
    }

  # module.repository_rust_lib["router"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"8a3c86d4faf07c4fa48ff7c647f40d78e1065272e3fe934eefedd5fc4541cb61\"" -> "W/\"a23d71dd27f8a96751d73e1736f61c69540e127f4719b8b7213cbd725e30fcdd\""
        id            = "lib-router:develop"
      ~ sha           = "baa27f86f9fa11574a3940755e71d4f2d50a3a69" -> "d6f2e8c380453aa9e5ee68a220d9d483f344d242"
        # (5 unchanged attributes hidden)
    }

  # module.repository_rust_lib["router"].github_repository.repository has changed
  ~ resource "github_repository" "repository" {
      ~ etag                   = "W/\"0acb2e4d1abae29ef05a22a15c4cba5741bae59423ccd8ed385e40b7c53e6b73\"" -> "W/\"29ffb1c2df85f8d497022a52bef7b0693f2f402337460a9e8d3670b860e9f24b\""
        id                     = "lib-router"
        name                   = "lib-router"
      + topics                 = []
        # (26 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["scheduler"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"a2c25d2f2615431707627a46410db9e1241922848698aea7e24106915661740c\"" -> "W/\"3a579586874533491eae136cb23fe91ac7f484520796b8db8a847a56bb54f135\""
        id            = "svc-scheduler:develop"
        # (6 unchanged attributes hidden)
    }

  # module.repository_rust_svc["storage"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"e4c2cd9fed1ff42063e178541a0466132d120830ea6afe89f7570e91a5c2b4ff\"" -> "W/\"9756d3226dab9c5100d0afaddd720d29fe0c5fd72f6f21f604e76a80d192cb4b\""
        id            = "svc-storage:develop"
        # (6 unchanged attributes hidden)
    }

  # module.repository_svc_template["python"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"e1471609392df1a573617c2e84189cc56b1c9fe80c07892d9cf28caeec74ed64\"" -> "W/\"4c1245c6dcf470e72bc475b9c8379c0101bd5e76dffb7b7ca18dce789c0e04ca\""
        id            = "svc-template-python:develop"
        # (6 unchanged attributes hidden)
    }

  # module.repository_svc_template["rust"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"251f4507b1dd5535ab31cd4840efcdc3ec42b136d624007d74d9e0648877fa98\"" -> "W/\"00dd933b4ae7b8573665da17cdcc66a3f98a80f1d06df9cd319b6bc9e66fef7b\""
        id            = "svc-template-rust:develop"
        # (6 unchanged attributes hidden)
    }

  # module.repository_svc_template["typescript"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"c34bb1c7c8911bb0c63738ca71be7ac16047e2863e08402e81bb9cb742045b32\"" -> "W/\"e2ed4019dfd58158bc508751a66da5cd61dae9e6b2a260a350df886394450089\""
        id            = "svc-template-typescript:develop"
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.repository["benchmarks"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHzRWt84Bqv9O"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["cla-bot"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHTAbhc4BmmRb"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["se-services"].github_branch.branch["develop"] will be created
  + resource "github_branch" "branch" {
      + branch        = "develop"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "se-services"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.repository["se-services"].github_branch_default.default will be created
  + resource "github_branch_default" "default" {
      + branch     = "develop"
      + id         = (known after apply)
      + repository = "se-services"
    }

  # module.repository["se-services"].github_branch_protection.all["se-services"] will be created
  + resource "github_branch_protection" "all" {
      + allows_deletions                = true
      + allows_force_pushes             = true
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = "se-services"
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false
    }

  # module.repository["se-services"].github_branch_protection.protection["develop"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "develop"
      + repository_id                   = "se-services"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 2
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository["se-services"].github_branch_protection.protection["main"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = "se-services"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository["se-services"].github_repository.repository will be created
  + resource "github_repository" "repository" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Systems Engineering documentation for Aerial Mobility Services"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = true
      + has_projects           = true
      + has_wiki               = true
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + name                   = "se-services"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.repository["se-services"].github_repository_file.CODEOWNERS will be created
  + resource "github_repository_file" "CODEOWNERS" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            * @Arrow-air/services
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "se-services"
      + sha                 = (known after apply)
    }

  # module.repository["se-services"].github_team_repository.maintainer["services"] will be created
  + resource "github_team_repository" "maintainer" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "se-services"
      + team_id    = "services"
    }

  # module.repository["tools"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHn-Jf84BmmRe"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["website"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOGdyvzM4BiRcN"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["website"].github_branch_protection.protection["staging"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOGdyvzM4BiRcL"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_lib_template["rust"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHwJLh84BqmYF"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_lib_template["rust"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHwJLh84BqmYD"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_lib["router"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9o84Bqidv"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_lib["router"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9o84Bqid1"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["scheduler"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9hc4Bqidr"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["scheduler"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9hc4Bqidt"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["storage"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9jc4BqieG"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_svc["storage"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9jc4BqieF"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["python"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHrbxrc4BqmXs"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["python"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHrbxrc4BqmXr"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["rust"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHn-JXc4BqmXz"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["rust"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHn-JXc4Bqprl"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["typescript"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHtu-d84BqmXu"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_svc_template["typescript"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHtu-d84BqmXx"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_tf["github"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOG6VIns4BpLGe"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 8 to add, 20 to change, 0 to destroy.

Changes to Outputs:
  ~ repositories = {
      ~ benchmarks    = {
          ~ repository     = {
              ~ branches                                = [
                  ~ {
                      ~ name      = "main" -> "GoodluckH-patch-1"
                      ~ protected = false -> true
                    },
                  + {
                      + name      = "am-smith/dw-336/stack-poem-openapi-poe"
                      + protected = false
                    },
                  + {
                      + name      = "main"
                      + protected = true
                    },
                ]
              ~ etag                                    = "W/\"8e000687176d661020f42a398bc35389e837b1feca85225045809854a993b982\"" -> "W/\"6dc7af7d815d3dedad0904a77ebc3dc9a25acbe71dcdea4da4df333d8c7ff7a1\""
                id                                      = "benchmarks"
                name                                    = "benchmarks"
              ~ topics                                  = null -> []
                # (32 unchanged elements hidden)
            }
            # (2 unchanged elements hidden)
        }
      + se-services   = {
          + branch         = {
              + develop = {
                  + branch        = "develop"
                  + etag          = (known after apply)
                  + id            = (known after apply)
                  + ref           = (known after apply)
                  + repository    = "se-services"
                  + sha           = (known after apply)
                  + source_branch = "main"
                  + source_sha    = (known after apply)
                }
            }
          + branch_default = {
              + branch     = "develop"
              + id         = (known after apply)
              + repository = "se-services"
            }
          + repository     = {
              + allow_auto_merge                        = false
              + allow_merge_commit                      = true
              + allow_rebase_merge                      = true
              + allow_squash_merge                      = true
              + archive_on_destroy                      = null
              + archived                                = false
              + auto_init                               = true
              + branches                                = (known after apply)
              + default_branch                          = (known after apply)
              + delete_branch_on_merge                  = true
              + description                             = "Systems Engineering documentation for Aerial Mobility Services"
              + etag                                    = (known after apply)
              + full_name                               = (known after apply)
              + git_clone_url                           = (known after apply)
              + gitignore_template                      = null
              + has_downloads                           = null
              + has_issues                              = true
              + has_projects                            = true
              + has_wiki                                = true
              + homepage_url                            = null
              + html_url                                = (known after apply)
              + http_clone_url                          = (known after apply)
              + id                                      = (known after apply)
              + ignore_vulnerability_alerts_during_read = null
              + is_template                             = false
              + license_template                        = null
              + name                                    = "se-services"
              + node_id                                 = (known after apply)
              + pages                                   = []
              + private                                 = (known after apply)
              + repo_id                                 = (known after apply)
              + ssh_clone_url                           = (known after apply)
              + svn_url                                 = (known after apply)
              + template                                = []
              + topics                                  = null
              + visibility                              = "public"
              + vulnerability_alerts                    = true
            }
        }
      ~ website       = {
          ~ branch         = {
              ~ staging = {
                  ~ etag          = "W/\"42cf6f348d048759fd70f344a8607d184d9dd1041130999955a00b15fac03336\"" -> "W/\"527d983cc448865e470026f03dd66e78e554e8ef265833fc3993896bdc98bbbf\""
                    id            = "website:staging"
                  ~ sha           = "ef829fc2d836ab69ddc4c61712d90bd477d770b4" -> "16577b7be6c593f6fc81874bbdb88f1b1e3267ed"
                    # (5 unchanged elements hidden)
                }
            }
            # (2 unchanged elements hidden)
        }
        # (3 unchanged elements hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @ServiceDog, Action: `pull_request`*